/*
    Модифицируйте последний вариант функции shouter, добавив такие условия:

    Если длина строки больше 0 и меньше 5, то вернуть оригинальную строку без повторений.
    Если длина строки ровно 5 символов, то вернуть строку, повторенную 10 раз.
    Условие «длина больше 5, то вернуть строку, повторенную 100 раз» должно сохраниться.
*/
const shouter = (text) => {
    let result = '';

    if (text.length > 5) {
        let counter = 0;
        while (counter !== 100) {
            result += text;
            counter++;
        };
    };
    if (text.length === 5) {
        let counter = 0;
        while (counter !== 10) {
            result += text;
            counter++;
        };
    };
    if (text.length > 0 && text.length < 5) {
        result = text;
    };

    return result;
};

//пробежаться по строке и подсчитать, сколько раз подстрока входит в строку
const getSubstrNumber = (str, sbstr) => {
    let counter = 0;
    while (str.length > 0) {
        if (str.substring(0, sbstr.length) === sbstr) {
            str = str.slice(sbstr.length);
            counter++;
        } else {
            str = str.slice(1);
        }
    }
    return counter;
};

//console.log(getSubstrNumber('123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456123456', '123456'));
//console.log(getSubstrNumber('12345123451234512345123451234512345123451234512345', '12345'));
//console.log(getSubstrNumber('123', '123'));

console.log(shouter('HELLO!'));
console.log(getSubstrNumber(shouter('HELLO!'), 'HELLO!'));
//console.log(shouter('12345'));
//console.log(shouter('123'));